In [1]:
# Import all the libraries
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt
from sklearn import linear_model
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.preprocessing import PolynomialFeatures
from sklearn.metrics import r2_score
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import mean_absolute_error

In [2]:
data = pd.read_excel("Data/1965-2013/Rainfall.xlsx",sheet_name='all')
data.head(10)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27,Unnamed: 28,Unnamed: 29,Unnamed: 30,Unnamed: 31,Unnamed: 32,Unnamed: 33
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Bang,lade,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,Daily,tot,al,Rain,fall,da,ta,in,Mill,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,Station,Year,Mo,1,2,3,4,5,6,7,...,22,23,24,25,26,27,28,29,30,31
8,Dhaka,1963,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
9,Dhaka,1963,2,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,NaN,NaN,NaN

In [3]:
# Delete First 7 Unnecessary rows
data = data.drop(labels=[i for i in range(0,7)], axis=0)
data.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27,Unnamed: 28,Unnamed: 29,Unnamed: 30,Unnamed: 31,Unnamed: 32,Unnamed: 33
7,Station,Year,Mo,1,2,3,4,5,6,7,...,22,23,24,25,26,27,28,29,30,31
8,Dhaka,1963,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
9,Dhaka,1963,2,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,NaN,NaN,NaN
10,Dhaka,1963,3,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
11,Dhaka,1963,4,0,0,1,0,0,2,0,...,13,0,0,0,0,0,0,0,25,NaN

In [4]:
#Resetting the index of the data
data = data.reset_index()
data.head(5)

,index,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,...,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27,Unnamed: 28,Unnamed: 29,Unnamed: 30,Unnamed: 31,Unnamed: 32,Unnamed: 33
0,7,Station,Year,Mo,1,2,3,4,5,6,...,22,23,24,25,26,27,28,29,30,31
1,8,Dhaka,1963,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,9,Dhaka,1963,2,0,0,0,0,0,0,...,0,0,0,0,0,0,0,NaN,NaN,NaN
3,10,Dhaka,1963,3,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
4,11,Dhaka,1963,4,0,0,1,0,0,2,...,13,0,0,0,0,0,0,0,25,NaN

In [5]:
# Deleting the previous index column
data = data.drop(labels='index',axis=1)
data.head(5)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27,Unnamed: 28,Unnamed: 29,Unnamed: 30,Unnamed: 31,Unnamed: 32,Unnamed: 33
0,Station,Year,Mo,1,2,3,4,5,6,7,...,22,23,24,25,26,27,28,29,30,31
1,Dhaka,1963,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,Dhaka,1963,2,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,NaN,NaN,NaN
3,Dhaka,1963,3,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
4,Dhaka,1963,4,0,0,1,0,0,2,0,...,13,0,0,0,0,0,0,0,25,NaN

In [6]:
# Setting the index of the dataframe to the first row
df = data.rename(columns=data.iloc[0]).drop(labels=0,axis=0)
df.head(5)
#Now the data is in good condition human readable format

,Station,Year,Mo,1,2,3,4,5,6,7,...,22,23,24,25,26,27,28,29,30,31
1,Dhaka,1963,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,Dhaka,1963,2,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,NaN,NaN,NaN
3,Dhaka,1963,3,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
4,Dhaka,1963,4,0,0,1,0,0,2,0,...,13,0,0,0,0,0,0,0,25,NaN
5,Dhaka,1963,5,0,47,29,0,17,0,3,...,3,0,0,0,0,0,0,25,2,22

In [7]:
# Renaming Column Mo to Month
df.rename(columns = {'Mo':'Month'}, inplace = True)
df.head(5)

,Station,Year,Month,1,2,3,4,5,6,7,...,22,23,24,25,26,27,28,29,30,31
1,Dhaka,1963,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,Dhaka,1963,2,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,NaN,NaN,NaN
3,Dhaka,1963,3,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
4,Dhaka,1963,4,0,0,1,0,0,2,0,...,13,0,0,0,0,0,0,0,25,NaN
5,Dhaka,1963,5,0,47,29,0,17,0,3,...,3,0,0,0,0,0,0,25,2,22

In [8]:
df.shape

(18076, 34)

In [9]:
# Function to show unique items in a column with a certain name to print info
def unique_items(df,column,unique_item_name):
    district = df[column].unique()
    num_of_district = district.size
    print('Total number of '+unique_item_name+': ' + str(num_of_district))
    print(district)

In [10]:
unique_items(df,'Station','Areas')

Total number of Areas: 37
['Dhaka' nan 'Station' 'Tangail' 'Mymensin' 'Faridpur' 'Madaripu'
 'Srimanga' 'Sylhet' 'Bogra' 'Rajshahi' 'Ishurdi' 'Dinajpur' 'Rangpur'
 'sydpur' 'chuadang' 'Jessore' 'Khulna' 'Mongla' 'Satkhira' 'Barisal'
 'Bhola' 'Khepupar' 'Patuakha' 'Chandpur' 'Teknaf' 'Chittago' 'Comilla'
 "Cox's Ba" 'Feni' 'Hatiya' 'Kutubdia' 'M.court' 'Rangamat' 'Sandwip'
 'Ambagan(' 'Sitakund']

In [11]:
# Deleting df['Station']='Station' datas from the df
df = df[df.Station != 'Station']

# Deleting nan values of df['Station']
df = df[df.Station.notna()]
unique_items(df,'Station','District')
df.head(5)

Total number of District: 35
['Dhaka' 'Tangail' 'Mymensin' 'Faridpur' 'Madaripu' 'Srimanga' 'Sylhet'
 'Bogra' 'Rajshahi' 'Ishurdi' 'Dinajpur' 'Rangpur' 'sydpur' 'chuadang'
 'Jessore' 'Khulna' 'Mongla' 'Satkhira' 'Barisal' 'Bhola' 'Khepupar'
 'Patuakha' 'Chandpur' 'Teknaf' 'Chittago' 'Comilla' "Cox's Ba" 'Feni'
 'Hatiya' 'Kutubdia' 'M.court' 'Rangamat' 'Sandwip' 'Ambagan(' 'Sitakund']

,Station,Year,Month,1,2,3,4,5,6,7,...,22,23,24,25,26,27,28,29,30,31
1,Dhaka,1963,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,Dhaka,1963,2,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,NaN,NaN,NaN
3,Dhaka,1963,3,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
4,Dhaka,1963,4,0,0,1,0,0,2,0,...,13,0,0,0,0,0,0,0,25,NaN
5,Dhaka,1963,5,0,47,29,0,17,0,3,...,3,0,0,0,0,0,0,25,2,22

In [12]:
df.shape

(17940, 34)

In [13]:
unique_items(df,'Month','Months')
unique_items(df,'Year','Years')

Total number of Months: 12
[1 2 3 4 5 6 7 8 9 10 11 12]
Total number of Years: 429
[1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1975 1976 1977
 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991
 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005
 2006 2007 2008 2009 2010 2011 2012 2013 'gh   1963' 'gh   1964'
 'gh   1965' 'gh   1966' 'gh   1967' 'gh   1968' 'gh   1969' 'gh   1970'
 'gh   1971' 'gh   1972' 'gh   1973' 'gh   1974' 'gh   1975' 'gh   1976'
 'gh   1977' 'gh   1978' 'gh   1979' 'gh   1980' 'gh   1981' 'gh   1982'
 'gh   1983' 'gh   1984' 'gh   1985' 'gh   1986' 'gh   1987' 'gh   1988'
 'gh   1989' 'gh   1990' 'gh   1991' 'gh   1992' 'gh   1993' 'gh   1994'
 'gh   1995' 'gh   1996' 'gh   1997' 'gh   1998' 'gh   1999' 'gh   2000'
 'gh   2001' 'gh   2002' 'gh   2003' 'gh   2004' 'gh   2005' 'gh   2006'
 'gh   2007' 'gh   2008' 'gh   2009' 'gh   2010' 'gh   2011' 'gh   2012'
 'gh   2013' 1974 'r    1977' 'r    1978' 'r    1980' 'r    1981'
 'r    1982' 'r    1983' 'r    1984' 'r    1985' 'r    1986' 'r    1987'
 'r    1988' 'r    1989' 'r    1990' 'r    1991' 'r    1992' 'r    1993'
 'r    1994' 'r    1995' 'r    1996' 'r    1997' 'r    1998' 'r    1999'
 'r    2000' 'r    2001' 'r    2002' 'r    2003' 'r    2004' 'r    2005'
 'r    2006' 'r    2007' 'r    2008' 'r    2009' 'r    2010' 'r    2011'
 'r    2012' 'r    2013' 'l    1963' 'l    1964' 'l    1965' 'l    1966'
 'l    1967' 'l    1968' 'l    1969' 'l    1970' 'l    1971' 'l    1972'
 'l    1973' 'l    1974' 'l    1975' 'l    1976' 'l    1977' 'l    1978'
 'l    1979' 'l    1980' 'l    1982' 'l    1983' 'l    1984' 'l    1985'
 'l    1986' 'l    1987' 'l    1988' 'l    1989' 'l    1990' 'l    1991'
 'l    1992' 'l    1993' 'l    1994' 'l    1995' 'l    1996' 'l    1997'
 'l    1998' 'l    1999' 'l    2000' 'l    2001' 'l    2002' 'l    2003'
 'l    2004' 'l    2005' 'l    2006' 'l    2007' 'l    2008' 'l    2009'
 'l    2010' 'l    2011' 'l    2012' 'l    2013' 'a    1989' 'a    1990'
 'a    1991' 'a    1992' 'a    1993' 'a    1994' 'a    1995' 'a    1996'
 'a    1997' 'a    1998' 'a    1999' 'a    2000' 'a    2001' 'a    2002'
 'a    2003' 'a    2004' 'a    2005' 'a    2006' 'a    2007' 'a    2008'
 'a    2009' 'a    2010' 'a    2011' 'a    2012' 'a    2013' 'a    1974'
 'a    1975' 'a    1976' 'a    1977' 'a    1978' 'a    1979' 'a    1980'
 'a    1981' 'a    1982' 'a    1983' 'a    1984' 'a    1985' 'a    1986'
 'a    1987' 'a    1988' 'li   1973' 'li   1975' 'li   1976' 'li   1977'
 'li   1978' 'li   1979' 'li   1981' 'li   1982' 'li   1983' 'li   1984'
 'li   1985' 'li   1986' 'li   1987' 'li   1988' 'li   1989' 'li   1990'
 'li   1991' 'li   1992' 'li   1993' 'li   1994' 'li   1995' 'li   1996'
 'li   1997' 'li   1998' 'li   1999' 'li   2000' 'li   2001' 'li   2002'
 'li   2003' 'li   2004' 'li   2005' 'li   2006' 'li   2007' 'li   2008'
 'li   2009' 'li   2010' 'li   2011' 'li   2012' 'li   2013' 'ng   1963'
 'ng   1964' 'ng   1965' 'ng   1966' 'ng   1967' 'ng   1968' 'ng   1969'
 'ng   1970' 'ng   1971' 'ng   1972' 'ng   1973' 'ng   1974' 'ng   1975'
 'ng   1976' 'ng   1977' 'ng   1978' 'ng   1979' 'ng   1980' 'ng   1981'
 'ng   1982' 'ng   1983' 'ng   1984' 'ng   1985' 'ng   1986' 'ng   1987'
 'ng   1988' 'ng   1989' 'ng   1990' 'ng   1991' 'ng   1992' 'ng   1993'
 'ng   1994' 'ng   1995' 'ng   1996' 'ng   1997' 'ng   1998' 'ng   1999'
 'ng   2000' 'ng   2001' 'ng   2002' 'ng   2003' 'ng   2008' 'ng   2009'
 'ng   2010' 'ng   2011' 'ng   2012' 'ng   2013' 'zar  1963' 'zar  1964'
 'zar  1965' 'zar  1966' 'zar  1967' 'zar  1968' 'zar  1969' 'zar  1970'
 'zar  1971' 'zar  1972' 'zar  1973' 'zar  1974' 'zar  1975' 'zar  1976'
 'zar  1977' 'zar  1978' 'zar  1979' 'zar  1980' 'zar  1981' 'zar  1982'
 'zar  1983' 'zar  1984' 'zar  1985' 'zar  1986' 'zar  1987' 'zar  1988'
 'zar  1989' 'zar  1990' 'zar  1991' 'zar  1992' 'zar  1993' 'zar  1994'
 'zar  1995' 'zar  1996' 'zar  1997' 'zar  1998' 'zar  1999' 'zar  2000'
 'zar  2001' 'zar  2002' 'zar  2003' 'zar  2004' 'zar  2005' 'zar  2006'
 'zar  2007' 'zar  2008' 'zar  2009' 'zar  2010' 'zar  2011' 'zar  2012'
 'zar  2013' 'i    1963' 'i    1964' 'i    1965' 'i    1966' 'i    1969'
 'i    1970' 'i    1971' 'i    1972' 'i    1973' 'i    1974' 'i    1975'
 'i    1976' 'i    1977' 'i    1978' 'i    1979' 'i    1980' 'i    1981'
 'i    1982' 'i    1983' 'i    1984' 'i    1985' 'i    1986' 'i    1987'
 'i    1988' 'i    1989' 'i    1990' 'i    1991' 'i    1992' 'i    1993'
 'i    1994' 'i    1995' 'i    1996' 'i    1997' 'i    1998' 'i    1999'
 'i    2000' 'i    2001' 'i    2002' 'i    2003' 'i    2004' 'i    2005'
 'i    2006' 'i    2007' 'i    2008' 'i    2009' 'i    2010' 'i    2011'
 'i    2012' 'i    2013' 'Ctg) 1999' 'Ctg) 2000' 'Ctg) 2001' 'Ctg) 2002'
 'Ctg) 2003' 'Ctg) 2004' 'Ctg) 2005' 'Ctg) 2006' 'Ctg) 2007' 'Ctg) 2008'
 'Ctg) 2009' 'Ctg) 2010' 'Ctg) 2011' 'Ctg) 2012' 'Ctg) 2013']

In [14]:
print(df['Year'].size)

df['Year'] = df['Year'].map(lambda x:int(x[-4:]) if (type(x) == str) else int(x))
print(df['Year'].size)
unique_items(df,'Year','Years')

17940
17940
Total number of Years: 51
[1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1975 1976 1977
 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991
 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005
 2006 2007 2008 2009 2010 2011 2012 2013 1974]

In [15]:
df.shape

(17940, 34)

In [17]:
df2 = df.copy()
unique_items(df2,'Station','Areas')

Total number of Areas: 35
['Dhaka' 'Tangail' 'Mymensin' 'Faridpur' 'Madaripu' 'Srimanga' 'Sylhet'
 'Bogra' 'Rajshahi' 'Ishurdi' 'Dinajpur' 'Rangpur' 'sydpur' 'chuadang'
 'Jessore' 'Khulna' 'Mongla' 'Satkhira' 'Barisal' 'Bhola' 'Khepupar'
 'Patuakha' 'Chandpur' 'Teknaf' 'Chittago' 'Comilla' "Cox's Ba" 'Feni'
 'Hatiya' 'Kutubdia' 'M.court' 'Rangamat' 'Sandwip' 'Ambagan(' 'Sitakund']

In [18]:
# Fixing the typo of the names of the areas

df2.loc[df2["Station"] == "Mymensin", "Station"] = "Mymensingh"
df2.loc[df2["Station"] == "Madaripu", "Station"] = "Madaripur"
df2.loc[df2["Station"] == "Srimanga", "Station"] = "Srimangal"
df2.loc[df2["Station"] == "sydpur", "Station"] = "Syedpur"
df2.loc[df2["Station"] == "chuadang", "Station"] = "Chuadanga"
df2.loc[df2["Station"] == "Khepupar", "Station"] = "Khepupara"
df2.loc[df2["Station"] == "Patuakha", "Station"] = "Patuakhali"
df2.loc[df2["Station"] == "Chittago", "Station"] = "Chittagong"
df2.loc[df2["Station"] == "Cox's Ba", "Station"] = "Cox's Bazar"
df2.loc[df2["Station"] == "Rangamat", "Station"] = "Rangamati"
df2.loc[df2["Station"] == "Sitakund", "Station"] = "Sitakunda"
df2.loc[df2["Station"] == "Ambagan(", "Station"] = "Ambagan(Ctg)"

In [19]:
unique_items(df2,'Station','Areas')

Total number of Areas: 35
['Dhaka' 'Tangail' 'Mymensingh' 'Faridpur' 'Madaripur' 'Srimangal'
 'Sylhet' 'Bogra' 'Rajshahi' 'Ishurdi' 'Dinajpur' 'Rangpur' 'Syedpur'
 'Chuadanga' 'Jessore' 'Khulna' 'Mongla' 'Satkhira' 'Barisal' 'Bhola'
 'Khepupara' 'Patuakhali' 'Chandpur' 'Teknaf' 'Chittagong' 'Comilla'
 "Cox's Bazar" 'Feni' 'Hatiya' 'Kutubdia' 'M.court' 'Rangamati' 'Sandwip'
 'Ambagan(Ctg)' 'Sitakunda']